In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    '날짜' : [1101, 1102, 1103, 1104, 1105],
    '온도' : [20, 18, 15, 14, 9]
}, columns = ['날짜','온도'])

In [3]:
df1

     날짜  온도
0  1101  20
1  1102  18
2  1103  15
3  1104  14
4  1105   9

In [4]:
df2 = pd.DataFrame(data={
    '날짜' : [1101, 1102, 1103, 1104, 1109, 1120],
    '습도' : [10, 20, 40, 80, 20, 30]
}, columns = ['날짜', '습도'])

In [5]:
df2

     날짜  습도
0  1101  10
1  1102  20
2  1103  40
3  1104  80
4  1109  20
5  1120  30

In [6]:
#두 개의 데이터프레임 병합
pd.merge(df1, df2) #how='inner'는 디폴트값

     날짜  온도  습도
0  1101  20  10
1  1102  18  20
2  1103  15  40
3  1104  14  80

겹치는 부분만 출력됨

In [7]:
pd.merge(df1, df2, how='outer')

     날짜    온도    습도
0  1101  20.0  10.0
1  1102  18.0  20.0
2  1103  15.0  40.0
3  1104  14.0  80.0
4  1105   9.0   NaN
5  1109   NaN  20.0
6  1120   NaN  30.0

how='outer'를 입력하면 모든 값들을 출력한다. 없는 값들은 NaN으로 반환

In [8]:
pd.merge(df1, df2, how='left')

     날짜  온도    습도
0  1101  20  10.0
1  1102  18  20.0
2  1103  15  40.0
3  1104  14  80.0
4  1105   9   NaN

df1을 기준으로 병합, 왼쪽의 데이터 기준

In [9]:
pd.merge(df1, df2, how='right')

     날짜    온도  습도
0  1101  20.0  10
1  1102  18.0  20
2  1103  15.0  40
3  1104  14.0  80
4  1109   NaN  20
5  1120   NaN  30

df2를 기준으로 병합, 오른쪽의 데이터 기준

In [10]:
pd.merge(df1, df2, how='right', on='날짜')

     날짜    온도  습도
0  1101  20.0  10
1  1102  18.0  20
2  1103  15.0  40
3  1104  14.0  80
4  1109   NaN  20
5  1120   NaN  30

In [11]:
df3 = pd.DataFrame({
    'date' : [1101, 1102, 1103, 1104, 1105],
    '온도' : [20, 18, 15, 14, 9]
}, columns = ['date','온도'])

In [12]:
df4 = pd.DataFrame({
    '날짜' : [1101, 1102, 1103, 1104, 1105],
    '습도' : [10, 20, 40, 80, 20]
}, columns = ['날짜','습도'])

In [13]:
pd.merge(df3, df4, left_on='date',right_on='날짜')

   date  온도    날짜  습도
0  1101  20  1101  10
1  1102  18  1102  20
2  1103  15  1103  40
3  1104  14  1104  80
4  1105   9  1105  20

df3과 df4를 동시에 보여줌 (만약 같은 컬럼명이 있으면 _x, _y로 구분해준다.)